Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/ryan-longoria/socialmedia_automation/4/default/prod-default.tfplan" -var-file=tfvars/prod-ue2-animeutopia.tfvars -var-file=/home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars' in '/home/atlantis/.atlantis/repos/ryan-longoria/socialmedia_automation/4/default': exit status 1
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.

aws_iam_role.step_functions_role: Refreshing state... [id=anime_step_functions_role]
aws_cloudwatch_event_rule.workflow_schedule: Refreshing state... [id=anime_workflow_schedule]
aws_iam_role.lambda_role: Refreshing state... [id=anime_lambda_role]
aws_iam_role.eventbridge_role: Refreshing state... [id=eventbridge_step_functions_role]
aws_s3_bucket.media_bucket: Refreshing state... [id=prod-ue2-animeutopia-media-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role.eventbridge_role is tainted, so must be replaced
-/+ resource "aws_iam_role" "eventbridge_role" {
      ~ arn                   = "arn:aws:iam::851725522400:role/eventbridge_step_functions_role" -> (known after apply)
      ~ create_date           = "2025-02-23T20:19:14Z" -> (known after apply)
      ~ id                    = "eventbridge_step_functions_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
        name                  = "eventbridge_step_functions_role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA4MTWMCXQJ5CQFPZZX" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # aws_iam_role.lambda_role is tainted, so must be replaced
-/+ resource "aws_iam_role" "lambda_role" {
      ~ arn                   = "arn:aws:iam::851725522400:role/anime_lambda_role" -> (known after apply)
      ~ create_date           = "2025-02-23T20:19:14Z" -> (known after apply)
      ~ id                    = "anime_lambda_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
        name                  = "anime_lambda_role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA4MTWMCXQBKBDFSOTD" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # aws_iam_role.step_functions_role is tainted, so must be replaced
-/+ resource "aws_iam_role" "step_functions_role" {
      ~ arn                   = "arn:aws:iam::851725522400:role/anime_step_functions_role" -> (known after apply)
      ~ create_date           = "2025-02-23T20:19:14Z" -> (known after apply)
      ~ id                    = "anime_step_functions_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
        name                  = "anime_step_functions_role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA4MTWMCXQDQSDI3ZU4" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "anime_lambda_role"
    }

  # aws_lambda_function.fetch_rss will be created
  + resource "aws_lambda_function" "fetch_rss" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/animeutopia/fetch_rss/fetch_rss.zip"
      + function_name                  = "fetch_rss"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.process_content will be created
  + resource "aws_lambda_function" "process_content" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/animeutopia/process_content_process_content.zip"
      + function_name                  = "process_content"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:481665084477:layer:imagick-layer:1",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IMAGE_MAGICK_EXE" = "/opt/bin/magick"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.render_video will be created
  + resource "aws_lambda_function" "render_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/animeutopia/render_video/render_video.zip"
      + function_name                  = "render_video"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "INSTANCE_ID" = "i-022e9bb5447996955"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.save_video will be created
  + resource "aws_lambda_function" "save_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/animeutopia/save_video/save_video.zip"
      + function_name                  = "save_video"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "INSTANCE_ID"   = "i-022e9bb5447996955"
              + "TARGET_BUCKET" = "prod-ue2-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 8 to add, 0 to change, 3 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Error: reading S3 Bucket (prod-ue2-animeutopia-media-bucket) ACL: operation error S3: GetBucketAcl, https response error StatusCode: 403, RequestID: M4ZDN0608VECFXCZ, HostID: CvND6vI23OuwP7dEqPbkpQNo4oHryGa26Z3CwTEUFi8XWwH2k7HGfwwKn2hP+hbWjK97jRE1ZKs=, api error AccessDenied: User: arn:aws:sts::851725522400:assumed-role/Atlantis-EC2-Role/i-01f4df6528d781d4c is not authorized to perform: s3:GetBucketAcl on resource: "arn:aws:s3:::prod-ue2-animeutopia-media-bucket" because no identity-based policy allows the s3:GetBucketAcl action
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
╵

```
</details>